<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 1, 512, 512"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_0:0,input_1:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="16, 1, 3, 3" size="576"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/model/conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="576" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model/conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model/conv2d/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d/Relu:0,StatefulPartitionedCall/model/dropout/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="640" shape="16, 16, 3, 3" size="9216"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_1/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/model/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_1/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="9856" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_1/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model/conv2d_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_1/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model/conv2d_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model/max_pooling2d/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/max_pooling2d/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="9920" shape="32, 16, 3, 3" size="18432"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_2/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_2/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="28352" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_2/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model/conv2d_2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_2/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model/conv2d_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_2/Relu:0,StatefulPartitionedCall/model/dropout_1/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="28480" shape="32, 32, 3, 3" size="36864"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_3/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model/conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_3/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="65344" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_3/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/model/conv2d_3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_3/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model/conv2d_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model/max_pooling2d_1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/max_pooling2d_1/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model/conv2d_4/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="65472" shape="64, 32, 3, 3" size="73728"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_4/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model/conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_4/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model/conv2d_4/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="139200" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_4/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model/conv2d_4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_4/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model/conv2d_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_4/Relu:0,StatefulPartitionedCall/model/dropout_2/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/model/conv2d_5/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="139456" shape="64, 64, 3, 3" size="147456"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_5/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/model/conv2d_5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_5/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/model/conv2d_5/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="286912" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_5/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/model/conv2d_5/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_5/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model/conv2d_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_5/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/model/max_pooling2d_2/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/max_pooling2d_2/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/model/conv2d_6/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="287168" shape="128, 64, 3, 3" size="294912"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_6/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model/conv2d_6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_6/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/model/conv2d_6/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="582080" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_6/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model/conv2d_6/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_6/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/model/conv2d_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_6/Relu:0,StatefulPartitionedCall/model/dropout_3/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model/conv2d_7/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="582592" shape="128, 128, 3, 3" size="589824"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_7/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/model/conv2d_7/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_7/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/model/conv2d_7/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="1172416" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_7/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/model/conv2d_7/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_7/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/model/conv2d_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_7/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/model/max_pooling2d_3/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/max_pooling2d_3/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/model/conv2d_8/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="1172928" shape="256, 128, 3, 3" size="1179648"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_8/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/model/conv2d_8/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_8/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model/conv2d_8/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="2352576" shape="1, 256, 1, 1" size="1024"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_8/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/model/conv2d_8/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_8/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model/conv2d_8/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_8/Relu:0,StatefulPartitionedCall/model/dropout_4/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/model/conv2d_9/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="2353600" shape="256, 256, 3, 3" size="2359296"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_9/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/model/conv2d_9/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_9/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model/conv2d_9/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="4712896" shape="1, 256, 1, 1" size="1024"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_9/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/model/conv2d_9/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_9/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model/conv2d_9/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_9/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="4713920" shape="256, 128, 2, 2" size="524288"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model/conv2d_transpose/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model/conv2d_transpose/Shape/GatherNCHWtoNHWC_input_port_1/value37046917" type="Const" version="opset1">
			<data element_type="i32" offset="5238208" shape="4" size="16"/>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/model/conv2d_transpose/Shape/GatherNCHWtoNHWC_input_port_2/value37067052" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/model/conv2d_transpose/Shape/GatherNCHWtoNHWC" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/model/conv2d_transpose/Shape:0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="1" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="5238232" shape="1" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="5238232" shape="1" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_transpose/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/model/conv2d_transpose/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="StatefulPartitionedCall/model/conv2d_transpose/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/model/conv2d_transpose/stack/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/model/conv2d_transpose/stack/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/model/conv2d_transpose/stack/Unsqueeze274" type="Const" version="opset1">
			<data element_type="i32" offset="5238240" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/model/conv2d_transpose/stack/Unsqueeze276" type="Const" version="opset1">
			<data element_type="i32" offset="5238240" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/model/conv2d_transpose/stack/Unsqueeze278" type="Const" version="opset1">
			<data element_type="i32" offset="5238244" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model/conv2d_transpose/stack" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/GatherNHWCtoNCHW_input_port_1/value37346971" type="Const" version="opset1">
			<data element_type="i32" offset="5238248" shape="4" size="16"/>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/GatherNHWCtoNCHW_input_port_2/value37366818" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/GatherNHWCtoNCHW" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/ss_0_port_input_port_1/value62006875" type="Const" version="opset1">
			<data element_type="i64" offset="5238264" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/ss_0_port_input_port_2/value62027043" type="Const" version="opset1">
			<data element_type="i64" offset="5238272" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/ss_0_port_input_port_3/value62046920" type="Const" version="opset1">
			<data element_type="i64" offset="5238232" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/ss_0_port" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="1" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose/Cast_2" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose" type="ConvolutionBackpropData" version="opset1">
			<data auto_pad="same_lower" dilations="1, 1" output_padding="0, 0" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/model/conv2d_transpose/conv2d_transpose:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/model/conv2d_transpose/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="5238280" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_transpose/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/model/conv2d_transpose/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_transpose/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/model/concatenate/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/concatenate/concat:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/model/conv2d_10/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="5238792" shape="128, 256, 3, 3" size="1179648"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_10/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/model/conv2d_10/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_10/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/model/conv2d_10/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="6418440" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_10/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/model/conv2d_10/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_10/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/model/conv2d_10/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_10/Relu:0,StatefulPartitionedCall/model/dropout_5/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/model/conv2d_11/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="6418952" shape="128, 128, 3, 3" size="589824"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_11/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/model/conv2d_11/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_11/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/model/conv2d_11/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="7008776" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_11/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/model/conv2d_11/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/conv2d_11/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/model/conv2d_11/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/conv2d_11/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="StatefulPartitionedCall/model/conv2d_transpose_1/conv2d_transpose/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="7009288" shape="128, 64, 2, 2" size="131072"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_transpose_1/conv2d_transpose/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="StatefulPartitionedCall/model/conv2d_transpose_1/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/model/conv2d_transpose_1/Shape/GatherNCHWtoNHWC_input_port_1/value37106992" type="Const" version="opset1">
			<data element_type="i32" offset="5238208" shape="4" size="16"/>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/model/conv2d_transpose_1/Shape/GatherNCHWtoNHWC_input_port_2/value37127079" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/model/conv2d_transpose_1/Shape/GatherNCHWtoNHWC" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/model/conv2d_transpose_1/Shape:0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="1" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="5238232" shape="1" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="5238232" shape="1" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="StatefulPartitionedCall/model/conv2d_transpose_1/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="101" name="StatefulPartitionedCall/model/conv2d_transpose_1/stack/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="5238224" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="StatefulPartitionedCall/model/conv2d_transpose_1/stack/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
